Revit 2027 API
MechanicalSystem.BaseEquipmentConnector Property
The connector within the base equipment which is used to connect with the system.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Connector BaseEquipmentConnector { get; set; }
Public Property BaseEquipmentConnector As Connector
	Get
	Set
public:
property Connector^ BaseEquipmentConnector {
	Connector^ get ();
	void set (Connector^ value);
}
member BaseEquipmentConnector : Connector with get, set
Property Value
Connector
Exceptions
Exception | Condition
ArgumentException |  Thrown when assigning a connector which is used in a system, or when the connector's owner is not of type 'mechanical equipment'.
InvalidOperationException |  Thrown when the set operation failed.
Remarks
Assigning null to the base equipment connector will disconnect the base equipment from the system.
See Also
Reference
MechanicalSystem Class
Autodesk.Revit.DB.Mechanical Namespace